#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/uux0vy-dev/runs/run-Ez1RYoUuuzw7sHBj

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
tls_private_key.private_key: Refreshing state... [id=93189a6e1018f93458f245bce5913f7380af26c8]
aws_cloudfront_function.request: Refreshing state... [id=ien-dev-cf-request]
aws_cloudfront_function.response: Refreshing state... [id=ien-dev-cf-response]
aws_ssm_parameter.public_key_ssm_param: Refreshing state... [id=/ien-dev/public-key]
aws_key_pair.key_pair: Refreshing state... [id=ien-dev-key]
aws_ssm_parameter.public_key_openssh_ssm_param: Refreshing state... [id=/ien-dev/public-key-openssh]
aws_s3_bucket.app: Refreshing state... [id=ien-dev-app]
aws_ssm_parameter.private_key_ssm_param: Refreshing state... [id=/ien-dev/private-key]
aws_iam_role.lambda: Refreshing state... [id=ien-dev-lambda]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ien-dev-ec2-role]
aws_apigatewayv2_api.api: Refreshing state... [id=h42aam618b]
aws_cloudfront_origin_access_identity.app: Refreshing state... [id=E2IVILJXHTCWXZ]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=api-gw/ien-dev-api/logs]
aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=ien-dev-lambda-20220401150128718800000002]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=ien-dev-lambda-20220401150128716700000001]
aws_iam_role_policy_attachment.lambda_execute: Refreshing state... [id=ien-dev-lambda-20220401150128751600000005]
aws_iam_role_policy_attachment.lambda_cloudwatch: Refreshing state... [id=ien-dev-lambda-20220401150128722800000004]
aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=ien-dev-lambda-20220401150128719700000003]
aws_apigatewayv2_stage.api: Refreshing state... [id=$default]
aws_db_subnet_group.pgsql: Refreshing state... [id=pgsql]
aws_rds_cluster.pgsql: Refreshing state... [id=ien-dev-db]
aws_lambda_function.api: Refreshing state... [id=ien-dev-api]
aws_rds_cluster_instance.pgsql[0]: Refreshing state... [id=ien-dev-db-0]
aws_instance.bastion_instance: Refreshing state... [id=i-05e4357923a54e6e4]
aws_s3_bucket_policy.app: Refreshing state... [id=ien-dev-app]
aws_cloudfront_distribution.app: Refreshing state... [id=EM85EBT6QA4PS]
aws_apigatewayv2_integration.api: Refreshing state... [id=d0ksdj8]
aws_lambda_permission.api_allow_gateway: Refreshing state... [id=terraform-20220401150623852600000001]
aws_apigatewayv2_route.api: Refreshing state... [id=jkgaazn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.api has changed
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
      ~ last_modified                  = "2022-04-20T20:39:17.000+0000" -> "2022-04-20T20:41:51.000+0000"
      ~ source_code_hash               = "eXiobXRAVOxI+ZD2l7659HWusIV6KF+sZWGdBr6KpKM=" -> "Dlj48qstgIH3HoB19V8rvhGN+UUQ5a+0pYOYbkoNZUs="
      ~ source_code_size               = 49017391 -> 49017433
        tags                           = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.hmbc_to_ien_applicants will be created
  + resource "aws_cloudwatch_event_rule" "hmbc_to_ien_applicants" {
      + arn                 = (known after apply)
      + description         = "8:00AM UTC - 1:00AM PST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "ien-dev-hmbc-to-ien-applicants"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_rule.hmbc_to_ien_masters will be created
  + resource "aws_cloudwatch_event_rule" "hmbc_to_ien_masters" {
      + arn                 = (known after apply)
      + description         = "7:00AM UTC - 12:00AM PST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "ien-dev-hmbc-to-ien-masters"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.hmbc_to_ien_applicants will be created
  + resource "aws_cloudwatch_event_target" "hmbc_to_ien_applicants" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + path = "applicant-data"
            }
        )
      + rule           = "ien-dev-hmbc-to-ien-applicants"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.hmbc_to_ien_masters will be created
  + resource "aws_cloudwatch_event_target" "hmbc_to_ien_masters" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + path = "master-data"
            }
        )
      + rule           = "ien-dev-hmbc-to-ien-masters"
      + target_id      = (known after apply)
    }

  # aws_instance.bastion_instance must be replaced
-/+ resource "aws_instance" "bastion_instance" {
      ~ ami                                  = "ami-034b13e2ca94e7832" -> "ami-029758462acdf767c" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ca-central-1:588188670678:instance/i-05e4357923a54e6e4" -> (known after apply)
      ~ availability_zone                    = "ca-central-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-05e4357923a54e6e4" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      - monitoring                           = false -> null
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ primary_network_interface_id         = "eni-005c1926dac988ff5" -> (known after apply)
      ~ private_dns                          = "ip-10-12-110-94.ca-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.12.110.94" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "ien-dev-bastion"
        }
      ~ tenancy                              = "default" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:ca-central-1:588188670678:key/59071ae1-5eab-4942-b7cb-e315b232f0c3" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0c1765d1550450d3f" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # aws_lambda_function.SyncApplicants will be created
  + resource "aws_lambda_function" "SyncApplicants" {
      + arn                            = (known after apply)
      + description                    = "Trigger Sync applicant and master data service"
      + filename                       = "./build/empty_lambda.zip"
      + function_name                  = "ien-dev-syncdata"
      + handler                        = "api/syncdata.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::588188670678:role/ien-dev-lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "0XCcYIn0+jTjUwxPorWwPN2f8zZKRGEzZOOQyWVxIQw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "RUNTIME_ENV" = "hosted"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0a37263c5e776d030",
            ]
          + subnet_ids         = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "d2813e3" -> "916be19"
              ~ "BUILD_INFO"        = "d2813e3, GitHub, IEN-222-remove-dynamic-routing-64, grafted, HEAD, tag: refs/tags/dev" -> "916be19, GitHub, Merge-021f81b6233817709e047628261c315360700fd8-into-71418c8c0ec4480335ce0c6ea9f117df78e7ebf3, grafted, HEAD, refs/remotes/pull/72/merge"
                # (12 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.hmbc_to_ien_applicants will be created
  + resource "aws_lambda_permission" "hmbc_to_ien_applicants" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ien-dev-syncdata"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch_Morning"
    }

  # aws_lambda_permission.hmbc_to_ien_masters will be created
  + resource "aws_lambda_permission" "hmbc_to_ien_masters" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ien-dev-syncdata"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch_Morning"
    }

Plan: 8 to add, 1 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 9 estimated
           $226.3600000000000008/mo +$0.0

```

</details>